Repository: RobinWeng/griffon-IDE
Catalog: po/*.po
Languages: fr

source: Search with DevHelp
fr: Recher avec DevHelp

source: Close the right tools and File Selector
fr: Fermer la gauche droite outils et le sélécteur de fichier

source: Close the right tools
fr: Fermer la gauche droite outils

source: Open the right tools
fr: Ouvrir la gauche droite outils

source: Search DevHelp
fr: Recherche DevHelp

source: Development of selection and BookMark (F5 to remove)
fr: Mise en valeur de la séléction et BookMark (F5 pour supprimer)

source: Run the project
fr: Executer le projet

source: Go to line
fr: Aller à la ligne

source: Next Search
fr: Recherche suivante

source: Find
fr: Rechercher

source: Save under another name
fr: Sauvegarder sous un autre nom

source: Save the file
fr: Sauvegarder le fichier

source: Open a file
fr: Ouvrir un fichier

source: Create a new file
fr: Créer un nouveau fichier

source: File
fr: Fichier

source: New
fr: Nouveau

source: Add a bookmark
fr: Ajouter un marque page

source: Open
fr: Ouvrir

source: Last open files
fr: Dérniers fichiers ouvert

source: Open different files
fr: Ouvrir different fichiers

source: Open a snippet
fr: Ouvrir un snippet

source: Open a template
fr: Ouvrir un template

source: Open a session file
fr: Ouvrir un fichier de session

source: Recent file
fr: Fichier recents

source: BookMark
fr: Marque page

source: Save
fr: Sauvegarder

source: Save as
fr: Sauvegarder sous

source: Save different files
fr: Sauvegarder different fichiers

source: Save session
fr: Sauvegarder session

source: Save as a template
fr: Sauvegarder sous un template

source: Save as a snippet
fr: Sauvegarder sous un snippet

source: Save Version
fr: Sauvegarder version

source: Back to save
fr: Revenir à la sauvegarde

source: Manager configuration file
fr: Manager le fichier de configuration

source: File auto replacement
fr: Fichier autoremplacement

source: main configuration
fr: Configuration principale

source: Keyboard shortcut
fr: Raccourci clavier

source: Configuring the User Menu
fr: Configuration du Menu utilisateur

source: Bookmark file
fr: Fichier de marque page

source: Config file for todo list
fr: Fichier de configuration todo liste

source: Configuration file MyAdmin
fr: Fichier de configuration MyAdmin

source: Reload MyAdmin
fr: Recharger MyAdmin

source: Close the file assets
fr: Fermer le fichier encours

source: Exit
fr: Quiter Griffon

source: Edit
fr: Editer

source: Copy
fr: Copier

source: Copy all the contents of the file
fr: Copier tous le contenu du fichier

source: Cut
fr: Couper

source: Paste
fr: Coller

source: Replace with clipboard
fr: Echanger avec le presse papier

source: Remove
fr: Supprimer

source: Cut and new file
fr: Couper et nouveau fichier

source: Copy and new file
fr: Copier et nouveau fichier

source: New file and paste
fr: Coller et nouveau fichier

source: Add to Crapbook
fr: Ajouter au Crapbook

source: Select all
fr: Tout séléctionner

source: Delete Row
fr: Supprimer la ligne

source: Undo
fr: Annuler action

source: Redo
fr: Refaire action

source: Find and Replace window
fr: Rechercher et remplacer fenêtre

source: Search (in the text box control)
fr: Rechercher (le texte en zone de commande)

source: Search case insensitive (the text box control)
fr: Rechercher avec case insensitive (le texte en zone de commande)

source: Search the following (text area control)
fr: Rechercher suivant (le texte en zone de commande)

source: Search according to case insensitive (the text box control)
fr: Rechercher suivant avec case insensitive (le texte en zone de commande)

source: Replace All (Command Line FIND_TEXT~TEXTE_REMPLACEMENT)
fr: Tout remplacer (Ligne de commande TEXTE_RECHERCHE~TEXTE_REMPLACEMENT)

source: Scan local HTML link (HREF)
fr: Scan lien HTML local (HREF)

source: Scan HTML image (SRC)
fr: Scan d'image HTML (SRC)

source: Function
fr: Fonctions

source: Insert a file path PATH
fr: Insert un chemin de fichier PATH

source: Stats document
fr: Stats du document

source: Analyze text UNIversal
fr: Analyser de texte UNIversal

source: UNITAZ sorts with abc
fr: UNITAZ avec trie abc

source: UNITAZ with sorting by account
fr: UNITAZ avec trie par compte

source: UNITAZ with case insensitive sorts with abc
fr: UNITAZ avec trie abc avec case insensitive

source: UNITAZ with case insensitive sorts by counting
fr: UNITAZ avec trie par compte case insensitive

source: Extract words
fr: Extraire des mots

source: User Menu
fr: Menu utilisateur

source: Insert
fr: Inserer

source: Char
fr: Caractères

source: Capital
fr: Majuscule

source: Tiny
fr: Minuscule

source: Capitalize the first letter of each word
fr: Majuscule sur la première lettre de chaque mot

source: Numbers
fr: Nombres

source: Arabic to Roman
fr: Arabe à Roman

source: Hexadecimal to decimal
fr: Hexadcimal au format décimal

source: Binary to decimal
fr: Binaire en décimal

source: Counter
fr: Compteur

source: Kill formatting
fr: Tuez le formatage

source: Kill the formatting on all lines
fr: Tuez le formatage sur chaque ligne

source: Wrapping the first position to
fr: Envelopper première à la position

source: Wrapped on the field at the position
fr: Envelopper sur les espaces à la position

source: Kill the spaces at the beginning of each line
fr: Tuez les espaces au début de chaque ligne

source: Kill spaces at the end of each line
fr: Tuez espaces à la fin de chaque ligne

source: Sort
fr: Trier

source: Sort lines
fr: Trier les lignes

source: Sort rows in length
fr: Trier les lignes en longueur

source: Sort rows with box insensetive
fr: Trier les lignes avec case insensetive

source: Reverse the order of lines
fr: Inverser l'ordre des lignes

source: String
fr: Chaîne

source: Remove blank lines
fr: Supprimer les lignes vides

source: Kill Duplicates
fr: Tuez les doublons

source: Number lines
fr: Numeroter les lignes

source: Convert tabs to spaces
fr: Convertir des tabulations en espaces

source: Convert spaces to tabs
fr: Convertir des espaces en tabulations

source: A model apply each line selection (the Ex command line:%s<br>)
fr: Appliquer un modle chaque ligne en séléction (sur la ligne de commande Ex: %s<br>)

source: Filter
fr: Filtrer

source: Kill the lines that contain an expression
fr: Tuez les lignes qui contiennent une expression

source: Kill all lines except one sentence
fr: Tuez toutes les lignes sauf une phrase

source: Kill all lines <N characters
fr: Tuez toutes les lignes < N caractères

source: Kill all lines> N characters
fr: Tuez toutes les lignes > N caractères

source: End of line
fr: Fin de ligne

source: Search with google text selection tab MyAdmin
fr: Recherche avec google du texte en séléction dans l'onglet MyAdmin

source: Google translation with text selection tab MyAdmin : FR to EN
fr: Traduction avec google du texte en séléction dans l'onglet MyAdmin FR vers EN

source: Google translation with text selection tab MyAdmin : EN to FR
fr: Traduction avec google du texte en séléction dans l'onglet MyAdmin EN vers FR

source: HTML tools
fr: HTML outils

source: Basic template
fr: Template de base

source: Basic Table
fr: Tableau de base

source: Remove HTML tags from the selection
fr: Supprimer les balises HTML de la séléction

source: Link around the selection
fr: Lien autour de la séléction

source: Convert special characters
fr: Convertir les caractères spéciaux

source: View the document weight
fr: Afficher le poids du document

source: Insert a DOCTYPE
fr: Inserer un DOCTYPE

source: HTML special characters
fr: Caractères spéciaux HTML

source: Bold
fr: Gras

source: Italics
fr: Italique

source: Underline
fr: Souligner

source: Comment
fr: Commenter

source: Paragraph
fr: Paragraphe

source: Link
fr: Lien

source: Color
fr: Couleur

source: Carriage return
fr: Retour chariot

source: Space
fr: Espace

source: Array elements
fr: Eléments de tableau

source: Align
fr: Aligner

source: Center
fr: Centrer

source: Left
fr: Gauche

source: Right
fr: Droite

source: justify
fr: Justifier

source: Help for BASH
fr: Aide BASH

source: Make the script executable
fr: Rendre éxecutable le script

source: Run the script BASH
fr: Executer le script BASH

source: Help for Perl
fr: Aide Perl

source: Exectuer perl script
fr: Exectuer le script perl

source: Projects
fr: Projets

source: New Project
fr: Nouveau projet

source: Open a project
fr: Ouvrir un projet

source: Save the project
fr: Sauvegarder le projet

source: Save the project under
fr: Sauvegarder le projet sous

source: Ownership of the project
fr: Propriété du projet

source: Run
fr: Executer

source: Mount a server SFTP (SSH)
fr: Monter un serveur en SFTP (SSH)

source: Mount a server FTP (FTPFS)
fr: Monter un serveur FTP (FTPFS)

source: Umount the last mounted server SFTP / FTP
fr: Démonter le dérnier serveur monté en SFTP/FTP

source: Tabs
fr: Onglets

source: Browsers
fr: Navigateurs

source: Scan links in the page
fr: Scan des liens dans la page

source: Links
fr: Liens

source: Go to beginning of block {
fr: Aller au début du bloque {

source: Go to end of block}
fr: Aller la fin du bloque }

source: Jump to recent tab
fr: Aller à un onglet récent

source: Go to the next tab
fr: Aller à l'onglet suivant

source: Go to the previous tab
fr: Allez à l'onglet pérécdent

source: Go to first tab
fr: Aller au premier onglet

source: Go to the last tab
fr: Aller au dérnier onglet

source: Go to the selection
fr: Aller à la séléction

source: Focus on the command line
fr: Focus sur la ligne de commande

source: Focus on the terminal
fr: Focus sur le terminal

source: Focus and reloading the tab get API URL
fr: Focus et rechargement sur l'onglet API get URL

source: Focus and reload Mini Web tab
fr: Focus et rechargement de l'onglet Mini Web

source: Focus and loading of the current page in the Web tab Mini
fr: Focus et chargement de la page courante dans l'onglet Mini Web

source: Focus on the text
fr: Focus sur le texte

source: Open the cursor
fr: Ouvrir au cursor

source: Edit the cursor
fr: Editer au cursor

source: View
fr: Vue

source: Syntax Color
fr: Coloration syntaxique

source: Reload syntax color
fr: Rafraichir la coloration syntaxique

source: Delete syntax color
fr: Supprimer la coloration syntaxique

source: Wrap
fr: Retour à la ligne

source: Display images in the text
fr: Afficher les images dans le texte

source: Switch between header / source
fr: Switcher entre header/source

source: Help
fr: Aide

source: Check your version of Griffon IDE
fr: Vérifiez votre version de Griffon IDE

source: Read the manual / documentation Griffon IDE
fr: Lire le manuel/documentation de Griffon IDE

source: Send a bug report
fr: Envoyer un rapport de bug

source: About Griffon IDE
fr: A-propos de Griffon IDE

source: List of include / functions
fr: Liste des include/fonctions

source: Line
fr: Ligne

source: Start the scan
fr: Débuter le scan

source: Open files include
fr: Ouvrir les fichiers include

source: Self complmentation list [SHIFT right] AutoComplmentation.
fr: Liste auto complémentation [SHIFT droit] AutoComplmentation.

source: Clear history
fr: Effacer historique

source: Mount a server
fr: Monter un serveur

source: Umount a server
fr: Démonter un volume

source: Remove BookMark
fr: Supprimer les BookMark

source: Information
fr: Informations

source: Saving a project
fr: Sauvegarder un projet

source: Make the project
fr: Make du projet

source: Delete
fr: Effacer

source: To view notes [ALT + M]
fr: Pour afficher les notes [ALT+M]

source: To integrate a selection in the note [CTR + E]
fr: Pour integrer une séléction dans la note [CTR+E] ____________________________________________________________________________________________________________________________________________________

source: Get to API or HTML source [Ctrl + G] to reload:
fr: Get pour api ou source HTML [Ctrl+G] pour recharger:

source: Get the URL
fr: Get sur l'URL

source: [Ctrl + R] reload [Ctrl + D] load current page:
fr: [Ctrl+R] recharger [Ctrl+D] charger page courante:

source: Load URL
fr: Charger l'URL

source: Loading the current page
fr: Charger la page courante

source: Open with Gimp
fr: Ouvrir avec Gimp

source: Insert the name of the image file in the current page
fr: Inserer le nom du fichier image dans la page courrante

source: TODO list
fr: TODO liste

source: You must install the DevHelp
fr: Vous devez installer le package DevHelp

source: Search DevHelp %s
fr: %s Recherche dans DevHelp

source: Griffon IDE 1.6.4 Autor : Philippe Muller Email : pmuller@lasotel.fr Developer and system administrator GNU / Linux Lasotel (Lyon).
fr: Griffon IDE 1.6.4 Auteur : Philippe Muller Email : pmuller@lasotel.fr Dveloppeur et Administrateur systme GNU/Linux pour Lasotel ( Lyon ).

source: Interpreted languages
fr: Langages interprétés

source: Data base
fr: Base de données

source: Web layout
fr: Web mise en page

source: Programming languages
fr: Langages de programmation

source: HTTP MyAdmin list
fr: Liste MyAdmin HTTP

source: [ALT + N] to configure [ALT + H] to reload
fr: [ALT+N] pour configurer [ALT+H] pour recharger

source: Griffon IDE documentation
fr: Documentation Griffon IDE

source: Griffon IDE Version
fr: Version Griffon IDE

source: Report Griffon IDE
fr: Rapport Griffon IDE

source: SFTP list
fr: Liste SFTP

source: History SFTP
fr: Historique SFTP

source: %s in directory mount SFTP Griffon_MONTAGE_SFTP
fr: %s montage SFTP dans le répertoire Griffon_MONTAGE_SFTP

source: FTP list
fr: Liste FTP

source: History FTP
fr: Historique FTP

source: The BookMark does not match the file being edited.
fr: Le BookMark ne correspond pas au fichier en cours d'édition.

source: Documentation is available in the menu "Help-> Read the manual/Griffon IDE documentation"
fr: La documentation est disponible dans le menu "Aide->Lire le manuel/documentation de Griffon IDE"

source: Encoding:
fr: Encodage:

source: %s Save File [OK]
fr: %s Sauvegarde [OK]

source: Save the file before ...
fr: Sauvegardez le fichier avant...

source: %s Save OK...
fr: %s Sauvegarde OK...

source: Save session as
fr: Sauvegarde de la session sous:

source: Open file session
fr: Ouverture du fichier de session:

source: Text to find the text to replace
fr: Texte pour trouver le texte à remplacer

source: Save as ...
fr: Sauvegarde sous...

source: %s there want to replace it?
fr: %s il existe voulez vous le remplacer?

source: Save error %s!!!
fr: error de la sauvegarde %s!!!

source: Now look in the Navigation menu-> Links.
fr: Maintenant, regardez dans le menu Navigation->Liens.

source: No, I can not!
fr: Non, je ne peux pas!

source: [INFO] You can specify the number of rows (TR) and the number of columns (TD) in the command line Example :2~2 For 2 TR and 2 TD
fr: [INFO] Vous poouvez indiquer le nombre de ligne (TR) et le nombre de colonne (TD) dans la ligne de commande Exemple :2~2 Pour 2 TR et 2 TD

source: I can not reload %s
fr: Je ne peux pas recharger %s

source: %s is reloaded
fr: %s est rechargé

source: Now look in the Navigation menu-> Links
fr: Maintenant, regardez dans le menu Navigation->Liens

source: Select a color
fr: Séléctionnez une couleur

source: Post your selections here ...
fr: Déposez vos séléctions ici...

source: [FUNCTION] :
fr: [FONCTION] :

source: [KEYWORD] :
fr: [MOT_CLEF] :

source: [Auto Comp] %s addition to self complmentation [SHIFT right] to display list in the text box.
fr: [Auto Comp] %s ajouté pour l'auto complémentation [SHIFT droit] Pour afficher la liste dans la zone de texte.

source: FILE PROJECT
fr: FICHIER PROJET :

source: #!/bin/bash # BASH script edited with Griffon: http://griffon.lasotel.fr # Date of creation of the script :
fr: #!/bin/bash # Script BASH edite avec Griffon: http://griffon.lasotel.fr # Date de creation du script :

source: # Message on the GUI xmessage -center -timeout 4 " Text display. "
fr: # Message sur l'interface graphique xmessage -center -timeout 4 " Texte a afficher. "

source: # Reading a file line by line while read ligne do done < file_path
fr: # Lecture d'un fichier ligne par ligne while read ligne do done < fichier

source: [ -e file_path ]
fr: [ -e fichier ]

source: [ -s file_path ]
fr: [ -s fichier ]

source: # Building an RPM package (thanks to the spec file in / usr / src / redhat /SPEC/) rpmbuild -ba file.spec
fr: # Construction d'un package RPM (grace au fichier spec dans /usr/src/redhat/SPEC/) rpmbuild -ba fichier.spec

source: [ -d directory ]
fr: [ -d repertoire ]

source: [ "string1" != "string2" ]
fr: [ "chaine1" != "chaine2" ]

source: [ -r file ]
fr: [ -r fichier ]

source: [ -w file ]
fr: [ -w fichier ]

source: [ -x file ]
fr: [ -x fichier ]

source: [ -L file ]
fr: [ -L fichier ]

source: [ -N file ]
fr: [ -N fichier ]

source: [ -G file ]
fr: [ -G fichier ]

source: [ -O file ]
fr: [ -O fichier ]

source: [ -n "string" ]
fr: [ -n "chaine" ]

source: [ file1 -nt file2 ]
fr: [ fichier1 -nt fichier2 ]

source: # Mount samba shares smbmount //192.168.1.1/share /point/of/montage username=login, password=***
fr: # Montage de partages samba smbmount //192.168.1.1/partage /point/de/montage username=toto, password=mdp

source: [ "number1" = "number2" ]
fr: [ "chiffre1" = "chiffre2" ]

source: # Rsync command rsync -avH --delete /directory/source /directory/destination >> /file/of_log
fr: # Commande Rsync rsync -avH --delete /repertoire/source /repertoire/destination >> /fichier/de_log

source: # Display output standare echo ""
fr: # Affichage sur la sortie standare echo ""

source: # Interactivity with the user echo "enter a value 'variable' :" read variable echo "The variable = $variable"
fr: # Interactivite avec l'utilisateur echo "entrez une valeur 'variable' :" read variable echo "La variable = $variable"

source: # Instruction if... if then fi
fr: # Instruction si... if then fi

source: > /file 2>&1
fr: > /fichier 2>&1

source: # Instruction if ...else if then else fi
fr: # Instruction si avec un sinon if then else fi

source: Data compression
fr: Compression de données

source: Compress file name:
fr: Nom du fichier à comprésser :

source: Compression
fr: Compréssion

source: #Compression archive tar.gz tar -cvf
fr: #Compression d'archive tar.gz tar -cvf

source: Grep help
fr: Aide pour Grep

source: Indifference Shift / Tiny
fr: Indifférence Maj/Min

source: full word
fr: Mot complet

source: Invert the output
fr: Inverser la sortie

source: Search word
fr: Mot recherché

source: Redirection file
fr: Fichier de redirection

source: # Grep Command (Find in a file) grep
fr: # Commande Grep (Find dans un fichier) grep

source: Sed help
fr: Aide Sed

source: Replace
fr: Remplacer par

source: N Occurrence (g = all)
fr: N Occurence (g = toutes)

source: Delete Rows
fr: Supprimer les lignes

source: of
fr: de

source: Delete rows with the search word
fr: Supprimer les lignes avec le mot recherché

source: Invert delete
fr: Inversser la suppression

source: Displays the result on the standard output
fr: Afiche le resultat sur la sortie standare

source: Gives the number of lines
fr: Donne le numero des lignes

source: # Sed command (cutting file) sed
fr: # Commande Sed (decoupage de fichier) sed

source: buffer_word
fr: tampon_mot

source: Number of options
fr: Nombre d'options

source: Number of options in the script:
fr: Nombre d'options du script :

source: option) #insert here the script for this option ;;
fr: option) #inserer ici le script pour cette option ;;

source: Awk help
fr: Aide Awk

source: Separator
fr: Separateur

source: Column
fr: Colonne

source: # Awk command (cutting file column) awk -F "
fr: # Commande Awk (decoupage de fichier par colonne) awk -F "

source: Echo color
fr: Echo en couleur

source: Text color:
fr: Couleur du texte :

source: Red
fr: Rouge

source: green
fr: vert

source: yellow
fr: jaune

source: Text :
fr: Texte :

source: Scan file [START]
fr: Scan fichier [START]

source: [Select a PATH] to insert the file
fr: [Séléctionnez un PATH] pour inserer dans le fichier

source: Select a file
fr: Sélectionnez un fichier

source: Name of function
fr: Nom de la Fonction :

source: Comment:
fr: Commantaire :

source: Create function
fr: Création de fonction

source: Link building
fr: Construction de lien

source: PATH of link
fr: Chemin du lien :

source: Link :
fr: Lien :

source: Symbolic link
fr: Lien Symbolique

source: # Symbolic link
fr: # Line Symbolique

source: Style variable
fr: Style de variable

source: User :
fr: Utilisateur :

source: Source file on the remote host:
fr: Fichier source sur le host distant :

source: Destination file:
fr: Fichier destination :

source: SCP command
fr: Commande SCP

source: # File copy with SCP
fr: # Copie de fichier avec SCP

source: foreach $value (@array) { }
fr: foreach $element (@tableau) { }

source: sub function_name { # display the argument 0 and 1 function print $_[0]; print $_[1]; }
fr: sub fonction { # afficher l'argument 0 et 1 de la fonction print $_[0]; print $_[1]; }

source: $number_of_characters=length($string);
fr: $nombre_de_caracteres=length($chaine);

source: $string=uc($string);
fr: $chaine=uc($chaine);

source: $string=lc($string);
fr: $chaine=lc($chaine);

source: $string=ucfirst($string);
fr: $chaine=ucfirst($chaine);

source: open (FILE, "file_path"); while ($ligne=<FILE>) { print $ligne; } close FILE;
fr: open (FICHIER, "nom_du_fichier"); while ($ligne=<FICHIER>) { print $ligne; } close FICHIER;

source: open (FILE, ">>file_path"); print FILE "Text written to the file"; close FILE;
fr: open (FICHIER, ">>nom_du_fichier"); print FICHIER "Text écrit dans le fichier"; close FICHIER;

source: open (FILE, ">file_path"); print FILE "Text written to the file"; close FILE;
fr: open (FICHIER, ">nom_du_fichier"); print FICHIER "Text écrit dans le fichier"; close FICHIER;

source: $chaine =~/find_string/
fr: $chaine =~/chaine recherche/

source: $string =~ s/find_string/replacement_string/g;
fr: $chaine =~ s/chaine recherche/chaine de remplacement/g;

source: @array = ("var0","var1","var2"); # display var0 print $array[0];
fr: @tableau = ("var0","var1","var2"); # affiche var0 print $tableau[0];

source: # <STDIN> expects keyboard input while (<STDIN>) { # avoids \n the last field chop; # displays the character entered without his \n print; }
fr: # <STDIN> attend une saisie clavier while (<STDIN>) { # évite \n du dernier champ chop; # affiche le caractre saisi sans son \n print; }

source: # Stacks value at end of table push $array, ("value");
fr: # Empile valeur en fin de tableau push $tableau, ("valeur");

source: # Stacks value at beginning of table shift $array, ("value");
fr: # Empile valeur en début de tableau shift $tableau, ("valeur");

source: # the ARGV array contains the list of program arguments. $argument0 = $ARGV[0];
fr: # le tableau ARGV contient la liste des arguments du programme. $argument0 = $ARGV[0];

source: # cutting the $string variable with respect to sparateur ";" and place the result in a array @array = split(/;/, $string);
fr: # découpe la variable $chaine par rapport au sparateur ";" et place le résultat dans un tableau @tableau = split(/;/, $chaine);

source: # Load the DBI module use DBI; # Connection parameters to the database $bd = 'db_name'; $serveur = 'localhost'; $identifiant = 'login'; $motdepasse = '****'; # Connection to the MySQL database $dbh = DBI->connect( "DBI:mysql:$bd:$serveur", $identifiant, $motdepasse ) or die "Can not connect to the database $bd !";
fr: # Charger le module DBI use DBI; # Paramètres de connexion à la base de données $bd = 'nom_de_base'; $serveur = 'localhost'; # Il est possible de mettre une adresse IP $identifiant = 'root'; # Identifiant $motdepasse = 'admin'; # Mot de passe # Connexion à la base de données MySQL $dbh = DBI->connect( "DBI:mysql:$bd:$serveur", $identifiant, $motdepasse ) or die "Connexion impossible à la base de données $bd !";
