Repository: RobinWeng/griffon-IDE
Catalog: po/*.po
Languages: fr

source: 3.8 (javascript): [onSubmit] Action Form Validation
fr: 3.8 (javascript) : [onSubmit] action en validation de formulaire

source: 4 Function
fr: 4 Fonctions

source: 4.1 (JavaScript) function retrieve the content of a file
fr: 4.1 (javascript) : Fonction récuperation du contenu d'un fichier

source: 1 Functions base [PERL]
fr: 1 Fonctions base [PERL]

source: 1.1 (perl): Start a script
fr: 1.1 (perl) : Débuter un script

source: 1.2 (perl) PRINT: Display a string
fr: 1.2 (perl) PRINT : afficher une chaîne de caractères

source: 1.3 (perl) ARGUMENTS: use the program arguments
fr: 1.3 (perl) ARGUMENTS : utiliser les arguments du programme

source: ARRAY
fr: TABLEAU

source: 1.4 (perl) array : declaring an array
fr: 1.4 (perl) TABLEAU : déclaration d'un tableau

source: 1.5 (perl) array : stack value at end of table
fr: 1.5 (perl) TABLEAU : empiler une valeur en fin de tableau

source: 1.6 (perl) array : stacking a array value at the beginning of
fr: 1.6 (perl) TABLEAU : empiler une valeur en début de tableau

source: 1.7 (perl) FOREACH: read a array row by row
fr: 1.7 (perl) FOREACH : lire un tableau ligne par ligne

source: 1.8 (perl) ENTRY: expects keyboard input
fr: 1.8 (perl) SAISIE : attend une saisie clavier

source: 1.9 (perl) FUNCTION: create a function
fr: 1.9 (perl) FONCTION : créer une fonction

source: 1.10 (perl) EXIT: exit (killer) program
fr: 1.10 (perl) EXIT : sortir (killer) le programme

source: 1.11 (perl) LOCALTIME: Recovery from the date
fr: 1.11 (perl) LOCALTIME : Récuperation de la date

source: 1.12 (perl) RAND: random number generation
fr: 1.12 (perl) RAND : génération d'un nombre aléatoire

source: 2.2 (perl) UNLESS: negative test
fr: 2.2 (perl) UNLESS : test négatif

source: 2.5 (perl) WHILE infinite
fr: 2.5 (perl) WHILE infinie

source: 2.6 (perl) FOREACH: read a array row by row
fr: 2.6 (perl) FOREACH : lire un tableau ligne par ligne

source: 3 file read write
fr: 3 Fichier lecture écriture

source: 3.1 (perl) Read a file line by line
fr: 3.1 (perl) Lire un fichier ligne par ligne

source: 3.2 (perl) to open a file for appending data
fr: 3.2 (perl) ouvrir un fichier pour y ajouter des données

source: 3.3 (perl) to open a file for appending data and overwrite the existing
fr: 3.3 (perl) ouvrir un fichier pour y ajouter des données et écraser l'éxistant

source: 3.4 (perl) open a pipe to a file
fr: 3.4 (perl) ouvrir un tube sur un fichier

source: 3.5 (perl) STDIN reading from standard input
fr: 3.5 (perl) STDIN Lecture de l'entrée standard

source: 3.6 (perl) STAT : recovery stats of a file ($dev,$ino,$mode,$nlink,$uid,$gid,$rdev,$size,$atime,$mtime,$ctime,$blksize,$blocks)
fr: 3.6 (perl) STAT : récuperation des stats d'un fichier ($dev,$ino,$mode,$nlink,$uid,$gid,$rdev,$size,$atime,$mtime,$ctime,$blksize,$blocks)

source: 4.1 (perl) SPLIT: split a string with delimiter
fr: 4.1 (perl) SPLIT : découper une chaîne avec séparateur

source: 4.2 (perl) IF UNLESS chain: education search for a string in a other string
fr: 4.2 (perl) IF UNLESS chaîne : instruction rechercher une chaîne dans une autre chaîne

source: 4.3 (perl) REPLACEMENT: find a string in a variable and replace
fr: 4.3 (perl) REMPLACEMENT : trouver une chaîne dans une variable et la remplacer

source: 4.4 (perl) CHOP: Removes the last character of the string
fr: 4.4 (perl) CHOP : Enlève le dernier caractère de la chaîne

source: 4.5 (perl) LENGTH: Returns the length of the string (number of characters)
fr: 4.5 (perl) LENGTH : Retourne la longueur de la chaîne (nombre de caractères)

source: 4.6 (perl) CPU: Returns the string to uppercase
fr: 4.6 (perl) UC : Retourne la chaîne en majuscules

source: 4.7 (perl) LC: Returns the string to lowercase
fr: 4.7 (perl) LC : Retourne la chaîne en minuscules

source: 4.8 (perl) ucfirst: Returns the string with the first character uppercase
fr: 4.8 (perl) UCFIRST : Retourne la chaîne avec le premier caractère en majuscule

source: 4.9 (perl) SUBSTR: returns a string contained between the start index and length
fr: 4.9 (perl) SUBSTR : retourne une chaîne contenue entre indice de début et la longueur

source: 5.1 (lib_dbi) CONNECTION: Connect to MySql database
fr: 5.1 (lib_dbi) CONNEXION : se connecter à une base MySql

source: 5.2 (lib_dbi) QUERY: simple query MySQL (UPDATE, DELETE, INSERT)
fr: 5.2 (lib_dbi) QUERY : simple requete Mysql (UPDATE,DELETE,INSERT)

source: 5.3 (lib_dbi) QUERY: simple query MySQL (SELECT)
fr: 5.3 (lib_dbi) QUERY : simple requete Mysql (SELECT)

source: 5.4 (lib_dbi) LOOP SELECT: mysql select with recuperation of loop data
fr: 5.4 (lib_dbi) SELECT BOUCLE : select mysql avec boucle de récuperation des données

source: 5.5 (lib dbi) LAST ID: recuperation of the last insert id in
fr: 5.5 (lib_dbi) LASTID : récuperation du dernier id en insert

source: 6.1 (lib_mime) Sending a simple email
fr: 6.1 (lib_mime) Envoi d'un mail simple

source: 6.2 (lib_mime) Sending mail with file
fr: 6.2 (lib_mime) Envoi d'un mail avec fichier PJ

source: 7 HTTP Lib URI and LWP
fr: 7 HTTP Lib URI et LWP

source: 7.1 (lib_URI) encoding a URL
fr: 7.1 (lib_URI) encodage d'une URL

source: 7.2 (lib_LWP) get a URL
fr: 7.2 (lib_LWP) get sur une URL

source: 8.1 (lib_net) connection to an FTP server
fr: 8.1 (lib_net) connexion à un serveur FTP

source: 8.2 (lib_net) list the contents of an FTP directory
fr: 8.2 (lib_net) lister le contenu d'un répertoire FTP

source: 8.3 (lib_net) GET to download a file from a FTP
fr: 8.3 (lib_net) GET télécharger un fichier depuis un FTP

source: 8.4 (lib_net) PUT upload a file on an FTP
fr: 8.4 (lib_net) PUT uploader un fichier sur un FTP

source: 9.1 (lib_socket) socket in listening mode (server) with fork
fr: 9.1 (lib_socket) socket en mode écoute (serveur) avec fork

source: 9.2 (lib_socket) socket client mode
fr: 9.2 (lib_socket) socket en mode client

source: 1.1 (bash) Start a script
fr: 1.1 (bash) Débuter un script

source: 1.2 (bash) ECHO: Display a string
fr: 1.2 (bash) ECHO : afficher une chaîne de caractères

source: 1.3 (bash) Add a comment
fr: 1.3 (bash) Ajouter un commentaire

source: 1.4 (bash) command in the background
fr: 1.4 (bash) Commande en tache de fond

source: 2.4 (bash) CASE: multiple choice
fr: 2.4 (bash) CASE : multi choix

source: 2.5 (bash) READ: interactivity with the user
fr: 2.5 (bash) READ : interactivite avec l'utilisateur

source: 3 Logical Operator
fr: 3 Opérateur logique

source: 3.1 (bash) AND
fr: 3.1 (bash) ET

source: 3.2 (bash) OR
fr: 3.2 (bash) OU

source: 4 Basic Commands
fr: 4 Commandes de base

source: 5 File Redirection
fr: 5 Redirection de fichier

source: 5.1 (bash) Output Redirection in the NULL
fr: 5.1 (bash) Redirection de la sortie dans le vide

source: 5.2 (bash) The output overwrites a file
fr: 5.2 (bash) La sortie écrase un fichier

source: 5.3 (bash) is added to the output file
fr: 5.3 (bash) La sortie est ajoutée à un fichier

source: 5.4 (bash) Redirecting errors
fr: 5.4 (bash) Redirection des erreurs

source: 5.5 (bash) Redirection errors and messages
fr: 5.5 (bash) Redirection des erreurs et des messages

source: 6 Building [TEST]
fr: 6 Construction de [TEST]

source: 6.1 (bash) TEST: if a file exists
fr: 6.1 (bash) TEST : si un fichier existe

source: 6.2 (bash) TEST: if a directory exists
fr: 6.2 (bash) TEST : si un répertoire existe

source: 6.3 (bash) TEST: Reverse test
fr: 6.3 (bash) TEST : inverser un test

source: 6.4 (bash) TEST: right reading
fr: 6.4 (bash) TEST : droit en lecture

source: 6.5 (bash) TEST: write permission
fr: 6.5 (bash) TEST : droit en écriture

source: 6.6 (bash) TEST: execution?
fr: 6.6 (bash) TEST : droit en execution

source: 6.7 (bash) TEST: two variables
fr: 6.7 (bash) TEST : sur deux variables

source: 6.8 (bash) TEST: two-digit
fr: 6.8 (bash) TEST : sur deux chiffres

source: You must open a file to use for help.
fr: Vous devez ouvrir un fichier pour pouvoir utiliser l'aide.

source: Programming support [Ctl + F] to search
fr: Aide à la programmation [Ctl+F] pour rechercher

source: Halp Php
fr: Aide Php

source: Help Mysql
fr: Aide MySql

source: Help HTML
fr: Aide HTML

source: Help CSS
fr: Aide CSS

source: Help Javascript Jquery
fr: Aide Javascript Jquery

source: Sorry, but I can not determine the character set %s. try again and select it manually.
fr: Désolé, mais je ne peux pas déterminer le jeu de caractères %s. Essayer de nouveau et sélectionnez-le manuellement.

source: %s is created
fr: %s est créé

source: Can not save to %s
fr: Ne peut pas faire de sauvegarde pour %s

source: The file is read-only.
fr: Le fichier est en lecture seule.

source: %s is not writable for you!
fr: %s n'est pas accessible en écriture pour vous!

source: And how I can save this text file as a directory?!
fr: Et comment je peux enregistrer ce fichier texte comme un répertoire?!

source: %s is closed
fr: %s est fermé

source: %s does not exist!
fr: %s n'existe pas!

source: You do not have permission to %s
fr: Vous n'avez pas les droits pour %s

source: %s is opened
fr: %s est ouvert

source: %s is modified but not saved, save?
fr: %s est modifié mais pas sauvegardé, le sauvegarder?

source: Default charset for file open
fr: Default charset pour fichier ouvert

source: Default charset for file saved as
fr: Default charset pour fichier sauvegardé sous

source: Default charset for RTF
fr: Default charset pour RTF

source: external image editor
fr: éditeur d'image externe

source: External image viewer
fr: Visionneuse d'image externe

source: Run MPlayer with subtitles
fr: Lancez MPlayer avec les sous-titres

source: History limit text input
fr: Limite de l'historique de saisie de texte

source: Max of recent files
fr: Max de fichiers récents

source: Date format and time
fr: Format de la date et de l'heure

source: The format of the function Color
fr: Le format de la fonction Couleur

source: Save / Open dialogs width cents for
fr: Enregistrer / Ouvrir largeur des boîtes de dialogue pour cents

source: Save / Open dialog boxes up to hundred
fr: Enregistrer / Ouvrir la hauteur des boîtes de dialogue pour cents

source: Show full path in window title
fr: Afficher le chemin complet dans le titre de la fenêtre

source: View the main toolbar
fr: Afficher la barre d'outils principale

source: Width of the image thumbnail
fr: Largeur de l'image thumbnail

source: Thumbnail image height
fr: Hauteur de l'image thumbnail

source: Griffon start with a recent file
fr: Lancer Griffon avec un fichier récent

source: Griffon start with an empty file
fr: Lancer Griffon avec un fichier vide

source: Determine the syntax of the file contents
fr: Déterminer la coloration syntaxique par le contenu du fichier

source: XHTML Mode for Markup
fr: Mode XHTML pour des Markup

source: Use snippets
fr: Utiliser les snippets

source: Use external image viewer
fr: Utiliser le visualisateur d'image externe

source: Syntax coloring to open the file
fr: Coloration de la syntaxe à l'ouverture du fichier

source: File backup
fr: Fichier backup

source: View numros line
fr: Afficher les numros de ligne

source: Analyze the links to open file
fr: Analyser les liens à l'ouverture de fichier

source: Warn before closing a modified file
fr: M'avertir avant la fermeture d'un fichier modifié

source: Overwrite existing file
fr: Ecraser le fichier existant

source: Restore configuration, please close and reopen the Preferences window.
fr: Configuration restaure, s'il vous plaît fermez et réouvrez la fenêtre Préférences.

source: Configuration reset by default, please close and reopen it Preferences window.
fr: Configuration remis à zéro par dfaut, s'il vous plaît fermez et réouvrez la fenêtre Préférences.

source: Saving the current configuration
fr: Sauvegarde de la configuration actuelle

source: Restoring a Configuration
fr: Restaurer une configuration

source: Reset default config
fr: Réinitialiser config par défaut

source: Editor
fr: Editeur

source: Foreground text
fr: Avant-plan du texte

source: Background text
fr: Arrière-plan du texte

source: selected plane
fr: Plan sélectionné

source: Background selects
fr: Arrire-plan sélectionne

source: Brands spellcheck
fr: Marques de vérification orthographique

source: Errors foreground (logmemo)
fr: Errors avant-plan (logmemo)

source: Errors back-end of the text (logmemo)
fr: Errors arrire-plan du texte (logmemo)

source: Editor font
fr: Editeur font

source: Comments font
fr: Commentaires font

source: Identifiers font
fr: Identificateurs font

source: numbers font
fr: Chiffres font

source: Use your browser
fr: Utilisez votre navigateur

source: Size tabs to spaces
fr: Taille des tabulations en espaces

source: Insert spaces the TAB key
fr: Insérer des espaces sur la touche TAB

source: automatic replacement
fr: Remplacement automatique

source: Main
fr: Principale

source: Encoding
fr: Encodage

source: Limitations
fr: Limites

source: commands
fr: Commandes

source: complementation
fr: Complémentation

source: Close
fr: Fermer

source: Save and apply
fr: Sauvegarder et aplliquer

source: 1.1 (htaccess) : Default charset (UTF-8)
fr: 1.1 (htaccess) : Charset par défaut (UTF8)

source: 1.2 (htaccess): block all IP
fr: 1.2 (htaccess) : bloquer toutes les ip

source: 1.3 (htaccess) : Allow IP
fr: 1.3 (htaccess) : Autoriser une ip

source: 1.4 (htaccess) : Redirect errors
fr: 1.4 (htaccess) : Redirection des erreurs

source: 1.5 (htaccess) : Enable URL rewriting
fr: 1.5 (htaccess) : Activation de l'url rewriting

source: 1.6 (htaccess) : online simple example url rewriting
fr: 1.6 (htaccess) : ligne exemple simple url rewriting

source: 1.7 (htaccess) : Example line with regular expression option and url rewriting
fr: 1.7 (htaccess) : ligne exemple avec option et expression régulière url rewriting

source: Generating a template code documentation in HTML
fr: Génération d'un template de documentation du code en HTML

source: 5.6 (php) NUM_ROWS: number of results of a query
fr: 5.6 (php) NUM_ROWS : récuperation du nombre de résultats d'une requete

source: Mkdir Error : you must enter the directory name in the command line
fr: Mkdir Error : vous devez entrer le nom du répertoire dans la ligne de commande

source: Mkdir Error: you must select a directory in the File Selector Tool.
fr: Mkdir Error : vous devez séléctionner un répertoire dans le sélécteur de fichier.

source: File Error: You must enter the file name in the command line
fr: File Error : vous devez entrer le nom du fichier dans la ligne de commande

source: File Error: you must select a directory in the File Selector Tool.
fr: File Error : vous devez séléctionner un répertoire dans le sélécteur de fichier.

source: Show information SPACE, TAB, NEWLINE ...
fr: Afficher les informations ESPACE,TAB,RETOUR CHARIOT...

source: Autocompletion of tags and block {} () ...
fr: Autocompletion des bloc et balises {} () ...

source: 4.9 (php) EXPLODE : split a string with separator and returns an array
fr: 4.9 (php) EXPLODE : découpe une chaîne avec séparateur et retourne un tableau

source: $array = explode(" ", $string);
fr: $tableau = explode(" ", $chaine);

source: 8.5 (lib_net) CWD Change directory
fr: 8.5 (lib_net) CWD Changer de répertoire

source: 8.6 (lib_net) DELETE Delete a file
fr: 8.6 (lib_net) DELETE Supprimer un fichier

source: 3.2 (php) UNLINK : delete a file
fr: 3.2 (php) UNLINK : supprimer un fichier

source: 3.3 (php) FPUTS : write to a file
fr: 3.3 (php) FPUTS : écrire dans un fichier

source: 1.9 (php) COUNT : Account all the elements of an array
fr: 1.9 (php) COUNT : Compte tous les éléments d'un tableau

source: $nbr=count($array);
fr: $nbr=count($tableau);

source: 3.4 (php) DIR : List the files in a directory in a table
fr: 3.4 (php) DIR : Lister les fichiers d'un répertoire dans un tableau

source: Enable spell check
fr: Activer la correction d'orthographe

source: 1.4 (javascript) : Encoding a URL
fr: 1.4 (javascript) : Encodage d'une URL

source: 4.10 (php) ADDSLASHES : Adds backslashes in a string
fr: 4.10 (php) ADDSLASHES : Ajoute des antislashs dans une chaîne

source: Open the logs in a file
fr: Ouvrir les logs dans un fichier

source: Save a text file
fr: Sauvegarder dans un fichier texte

source: Translation
fr: Traduction

source: Help/Search
fr: Aide/Recherche

source: 5.6 (lib_dbi) ROWS: rows recovery number of results for a query
fr: 5.6 (lib_dbi) ROWS : rows récupération du nombre de résultats pour une requête

source: Google search
fr: Recherche Google

source: The search result is available in the tab: MyAdmin-> Help/Search
fr: Le résultat de la recherche est disponible dans l'onglet : MyAdmin->Aide/Recherche

source: The result of the translation is available in the tab: MyAdmin-> Translation
fr: Le résultat de la traduction est disponible dans l'onglet : MyAdmin->Traduction

source: The directory is created.
fr: Le répertoire est créé.

source: The file is created.
fr: Le fichier est créé.

source: The bookmark is available in the tab: Mark
fr: Le bookmark est disponible dans l'onglet : Mark

source: Visualization is available in the tab Mini Web
fr: La visualisation est disponible dans l'onglet Mini Web

source: 7.3 (php) Download a CSV file
fr: 7.3 (php) Téléchargement d'un fichier CSV

source: 1.1 (term) : Disk Usage
fr: 1.1 (term) : Utilisation du disque

source: 1.2 (term) : Extractors website WGET
fr: 1.2 (term) : Aspiration de site web WGET

source: 1.3 (term) : RM on a large number of files
fr: 1.3 (term) : RM sur un grand nombre de fichiers

source: 1.4 (term) : FIND find a file by name
fr: 1.4 (term) : FIND trouver un fichier par son nom

source: 1.5 (term) : SCREEN Launch a screen or recover
fr: 1.5 (term) : SCREEN Lancer un screen ou le récupérer

source: 1.6 (term) : WC number of lines to output or file
fr: 1.6 (term) : WC Nombre de lignes pour sortie ou fichier

source: 1.7 (term) : WGET download web page
fr: 1.7 (term) : WGET récupération de page web

source: 1.8 (term) : List files and directories in color
fr: 1.8 (term) : Lister les fichiers et répertoire en couleur

source: 1.9 (term) : NICE Launch a script or command heavy with low priority
fr: 1.9 (term) : NICE Lancer un script ou commande lourde avec une priorité basse

source: Download Error : You must select a directory in the File Selector Tool
fr: Download Error : vous devez séléctionner un répertoire dans le sélécteur de fichier

source: 2.0 (term) : Compression with tar.gz
fr: 2.0 (term) : Compression avec tar.gz

source: 2.1 (term) : Unzip with tar.gz
fr: 2.1 (term) : Décompression avec tar.gz

source: 2.2 (term) : Difference between two files
fr: 2.2 (term) : Différence entre deux fichiers

source: The file is open and available in the Editor tab
fr: Le fichier est ouvert et disponible dans l'onglet Editor
