Repository: RobinWeng/griffon-IDE
Catalog: po/*.po
Languages: fr

source: # Loop on a MySql query $query = "SELECT group_attribute FROM table WHERE condition"; $sth = $dbh->prepare($query); $sth->execute; while($row = $sth->fetchrow_hashref) { # Recovery values $champs_mysql = "$row->{champs_mysql}"; }
fr: # Boucle sur une requete MySql $query = "SELECT groupe_attribut FROM table WHERE condition"; $sth = $dbh->prepare($query); $sth->execute; while($row = $sth->fetchrow_hashref) { # Récuperation des valeurs $champs_mysql = "$row->{champs_mysql}"; }

source: # single MySql query $query = ""; $sth = $dbh->do($query);
fr: # simple requete MySql $query = ""; $sth = $dbh->do($query);

source: chop($string);
fr: chop($chaine);

source: use MIME::Lite; ####### SEND EMAIL my $Message = new MIME::Lite From =>"NAME FROM <from\@from.net>", To =>$email_destination, Subject =>$subject, Type =>'TEXT', Data =>"$message", Content-Transfer-Encoding => 'quoted-printable'; $Message->send;
fr: use MIME::Lite; ####### ENVOI EMAIL my $Message = new MIME::Lite From =>"NOM FROM <from\@from.net>", To =>$email_destination, Subject =>$sujet, Type =>'TEXT', Data =>"$message", Content-Transfer-Encoding => 'quoted-printable'; $Message->send;

source: ($sec,$min,$hour,$day,$month,$year,$sday,$aday,$isdst) = localtime(time); $month=$month+1; if($month<10){$month="0".$month;} if($day<10){$day="0".$day;} $year=1900+$year; $date_sql=$year."-".$month."-".$day;
fr: ($sec,$min,$heure,$mjour,$mois,$annee,$sjour,$ajour,$isdst) = localtime(time); $mois=$mois+1; if($mois<10){$mois="0".$mois;} if($mjour<10){$mjour="0".$mjour;} $annee=1900+$annee; $date_sql=$annee."-".$mois."-".$mjour;

source: use MIME::Lite; ####### SEND EMAIL my $Message = new MIME::Lite From =>"NAME_FROM <from\@from.net>", To =>$email_destination, Subject =>$subject, Type =>'multipart/mixed'; attach $Message Type =>'TEXT', Data =>$message; attach $Message Type =>'application/txt', Path =>$path_file, Filename =>$name_file_txt; $Message->send;
fr: use MIME::Lite; ####### SEND EMAIL my $Message = new MIME::Lite From =>"NAME_FROM <from\@from.net>", To =>$email_destination, Subject =>$subject, Type =>'multipart/mixed'; attach $Message Type =>'TEXT', Data =>$message; attach $Message Type =>'application/txt', Path =>$chemin_local_du_fichier, Filename =>$nom_fichier_txt; $Message->send;

source: $query2 = "SELECT group_attribute FROM table WHERE condition"; $sth2 = $dbh->prepare($query2); $sth2->execute; $row2 = $sth2->fetchrow_hashref; $value_mysql = "$row2->{value_mysql}";
fr: $query2 = "SELECT groupe_attribut FROM table WHERE condition"; $sth2 = $dbh->prepare($query2); $sth2->execute; $row2 = $sth2->fetchrow_hashref; $champs_mysql = "$row2->{champs_mysql}";

source: use URI::Escape; $url_encode = uri_escape($url_encoder);
fr: use URI::Escape; $url_encode = uri_escape($url_a_encoder);

source: use LWP::Simple; $return = get($url);
fr: use LWP::Simple; $doc_retour = get($url);

source: $ftp->cwd("$a_directory_listing"); @ls = $ftp->ls("."); foreach $file (@ls) { print "$file\n"; }
fr: $ftp->cwd("$repertoire_a_lister"); @ls = $ftp->ls("."); foreach $file (@ls) { print "$file\n"; }

source: $ftp->get($file_source_ftp,"$file_destination_local");
fr: $ftp->get($fichier_source_ftp,"$fichier_destination_local");

source: $ftp->put($file_local,"$file_destination_ftp");
fr: $ftp->put($fichier_local,"$fichier_destination_ftp");

source: $string_return=substr($string, $int_indice_start, $int_length);
fr: $chaine_resultat=substr($chaine, $int_indice_debut, $int_longueur);

source: $file="tail -f -n 1 /path/file/pipe |"; open(FICHE, $file); while($line=<FILE>) { print $line; } close FILE;
fr: $fichier="tail -f -n 1 /votre/fichier/tube |"; open(FICHIER, $fichier); while($ligne=<FICHIER>) { print $ligne; } close FICHIER;

source: while ($line=<STDIN>) { }
fr: while ($ligne=<STDIN>) { }

source: $rand=rand($number_max);
fr: $rand=rand($nombre_max);

source: ($dev,$ino,$mode,$nlink,$uid,$gid,$rdev,$size,$atime,$mtime,$ctime,$blksize,$blocks)= stat($filename);
fr: # dev numro de device du systme de fichiers # ino numro d'inode # mode droits du fichier (type et permissions) # nlink nombre de liens (hard) sur le fichier # uid ID numrique de l'utilisateur propritaire du fichier # gid ID numrique du groupe propritaire du fichier # rdev l'identificateur de device (fichiers spciaux uniquement) # size taille totale du fichier, en octets # atime date de dernier accs en secondes depuis l'origine des temps # mtime date de dernire modification en secondes depuis l'origine des temps # ctime date de dernire modification de l'inode en secondes depuis l'origine des temps (*) # blksize taille de blocs prfre pour les E/S sur fichiers # blocks nombre de blocs rellement occups ($dev,$ino,$mode,$nlink,$uid,$gid,$rdev,$size,$atime,$mtime,$ctime,$blksize,$blocks)= stat($filename);

source: INSERT INTO your_table (name_attribut1,name_attributN) values ('value1','valueN')
fr: INSERT INTO votre_table (nomattribut1,nomattributN) values ('valeur1','valeurN')

source: UPDATE name_table Set name_attribut1=value1,name_attributN=valueN WHERE condition
fr: UPDATE nomdetable Set nomattribut1=expression1,nomattributN=expressionN WHERE condition

source: SELECT group_attribut FROM table WHERE condition
fr: SELECT groupe_attribut FROM table WHERE condition

source: DELETE attributN FROM name_table WHERE condition
fr: DELETE attributN FROM nomdetable WHERE condition

source: $inforeq = "SELECT values FROM tables WHERE conditions"; $infoq = mysql_query($inforeq); while($line = mysql_fetch_object($infoq)) { $value=$line->value; }
fr: $inforeq = "SELECT champs FROM tables WHERE conditions"; $infoq = mysql_query($inforeq); while($ligne = mysql_fetch_object($infoq)) { $champs=$ligne->champs; }

source: foreach ($array as $line_num => $line) { }
fr: foreach ($tableau as $ligne_num => $ligne) { }

source: $array = preg_split("\/[;]+\/", $variable);
fr: $tableau = preg_split("\/[;]+\/", $variable);

source: $string = eregi_replace ("string to replace","replacement string",$string);
fr: $chaine = eregi_replace ("chaine remplacer","chaine de remplacement",$chaine);

source: $array = file("http://url or file");
fr: $tableau = file("http://url ou fichier");

source: if(strstr($string, $find_string)) { }
fr: if(strstr($chaine, $chaine_recherche)) { }

source: function function_name($var1,$var2) { }
fr: function nom_de_fonction($var1,$var2) { }

source: $string=stripslashes($string);
fr: $chaine=stripslashes($chaine);

source: mail("email","subject","message","From: name_frome <email@sender_domaine.net>\nContent-Type: text;\n");
fr: mail("email","sujet","message","From: nom <email@qui-envoi.net>\nContent-Type: text;\n");

source: \/\/****** Connexion serveur FTP $ftp_connection = ftp_connect("$ip_server"); $ftp_login = ftp_login($ftp_connection,"$login", "$password"); $ftp_directory = ftp_chdir($ftp_connection,"/");
fr: \/\/****** Connexion serveur FTP $ftp_connexion = ftp_connect("$ip_serveur"); $ftp_login = ftp_login($ftp_connexion,"$login", "$password"); $ftp_repertoire = ftp_chdir($ftp_connexion,"/");

source: //******* List files in a $directory in array $array = ftp_nlist($ftp_connection,"$directory");
fr: //******* Liste les fichiers de $repertoire dans un tableau $tableau = ftp_nlist($ftp_connexion,"$repertoire");

source: ftp_put($ftp_connection,$path_file,$name_file_put, FTP_BINARY);
fr: ftp_put($ftp_connexion,$path_fichier,$nom_fichier_depose, FTP_BINARY);

source: ftp_delete($ftp_connection, $file_delete);
fr: ftp_delete($ftp_connexion, $fichier_supprime);

source: $inforeq2 = "SELECT values FROM tables WHERE conditions"; $infoq2 = mysql_query($inforeq2); $ligne2 = mysql_fetch_object($infoq2); $value=$ligne2->value;
fr: $inforeq2 = "SELECT champs FROM tables WHERE conditions"; $infoq2 = mysql_query($inforeq2); $ligne2 = mysql_fetch_object($infoq2); $champs=$ligne2->champs;

source: $number_of_characters=strlen($string);
fr: $nbr_caracteres=strlen($chaine);

source: $url=urlencode($string);
fr: $url=urlencode($chaine);

source: $value=rand($min,$max );
fr: $valeur=rand($min,$max );

source: $occurrence_count=mb_substr_count($string, $find_string);
fr: $nbr_occurrences=mb_substr_count($chaine, $chaine_a_trouver);

source: $string=strip_tags($string_html);
fr: $chaine=strip_tags($chaine_html);

source: <form name="name_form" method="post" action="page.php"> <input type="submit" value="Submit"> </form>
fr: <form name="nom_formulaire" method="post" action="page.php"> <input type="submit" value="Valider"> </form>

source: <input type="text" name="name_text" value="default">
fr: <input type="text" name="nom_text" value="default">

source: <textarea name="name_textarea"> Text displayed in the textarea tag </textarea>
fr: <textarea name="nom_textarea"> Texte affiché dans la balise textarea </textarea>

source: <select name="name_select"> <option selected value="value">VALUE</option> <option value="value2">VALUE2</option> </select>
fr: <select name="nom_select"> <option selected value="valeur">VALEUR</option> <option value="valeur2">VALEUR2</option> </select>

source: function name_function() { }
fr: function Nom_De_Votre_Fonction() { }

source: var Value=document.getElementById('YOUR_ID').value;
fr: var Value=document.getElementById('VOTRE_ID').value;

source: document.getElementById('YOUR_ID').focus();
fr: document.getElementById('VOTRE_ID').focus();

source: var selectValue = document.getElementById('YOUR_ID').options[document.getElementById('YOUR_ID').selectedIndex].value;
fr: var selectValue = document.getElementById('VOTRE_ID').options[document.getElementById('VOTRE_ID').selectedIndex].value;

source: $('#YOUR_ID').load('FILE_PHP_HTML');
fr: $('#VOTRE_ID').load('FICHIER_PHP_HTML');

source: document.getElementById('YOUR_ID').innerHTML ="YOUR TEXT";
fr: document.getElementById('VOTRE_ID').innerHTML ="VOTRE TEXT";

source: document.getElementById('YOUR_ID').value = "YOUR_TEXTE";
fr: document.getElementById('VOTRE_ID').value = "VOTRE_TEXTE";

source: document.getElementById('YOUR_ID').value += "YOUR_TEXT";
fr: document.getElementById('VOTRE_ID').value += "VOTRE_TEXT";

source: //split YOUR_STRING in array ";" var reg=new RegExp("[;]+", "g"); var array=YOUR_STRING.split(reg);
fr: //split VOTRE_CHAINE dans un tableau var reg=new RegExp("[;]+", "g"); var tableau=VOTRE_CHAINE.split(reg);

source: var File = function File(file) { if(window.XMLHttpRequest) obj = new XMLHttpRequest(); //Firefox, Opera,... else if(window.ActiveXObject) obj = new ActiveXObject("Microsoft.XMLHTTP"); //Internet Explorer else return(false); if (obj.overrideMimeType) obj.overrideMimeType("text/xml"); // bug Safari obj.open("GET", file, false); obj.send(null); if(obj.readyState == 4) return(obj.responseText); else return(false); } var Return = File('page.php');
fr: var Fichier = function Fichier(fichier) { if(window.XMLHttpRequest) obj = new XMLHttpRequest(); //Pour Firefox, Opera,... else if(window.ActiveXObject) obj = new ActiveXObject("Microsoft.XMLHTTP"); //Pour Internet Explorer else return(false); if (obj.overrideMimeType) obj.overrideMimeType("text/xml"); //vite un bug de Safari obj.open("GET", fichier, false); obj.send(null); if(obj.readyState == 4) return(obj.responseText); else return(false); } var Contenu = Fichier('page.php');

source: You must select a word or text to use a BookMark
fr: Vous devez séléctionner un mot ou du texte pour utiliser un BookMark

source: You must install the curlftpfs to use the mounting SFTP
fr: Vous devez installer le package curlftpfs pour utiliser la fonction montage SFTP

source: %s umount FTP/SFTP
fr: %s démontage FTP/SFTP

source: No mounted server FTP / SFTP
fr: Aucun serveur monté en FTP/SFTP

source: Mount a SFTP server
fr: Monter un serveur en SFTP

source: Server name or ip:
fr: Nom du serveur ou ip :

source: Path on the server:
fr: Chemin sur le serveur :

source: Mount SFTP
fr: Montage SFTP

source: Mount a FTp server
fr: Monter un serveur en FTP

source: Mount FTP
fr: Montage FTP

source: The script is not saved or is not selected
fr: Les script n'est pas sauvegardé ou n'est pas séléctionné

source: Execution of script %s [OK]
fr: Execution du script %s [OK]

source: You must install the gimp to use the edition image
fr: Vous devez installer le package gimp pour utiliser la fonction edition d'image

source: MINIDO_PROFILE variable for the todo list is not findable (normally /home/user/.griffon/griffon_todo)
fr: MINIDO_PROFILE variable pour la todo liste n'est pas trouvable (normalement /home/user/.griffon/griffon_todo)

source: The xml tag is invalid in %s file : /home/user/.griffon/griffon_todo
fr: Le tag xml %s est invalide dans le fichier : /home/user/.griffon/griffon_todo

source: Tag invalid xml file todo list : %s
fr: Tag xml invalide dans le fichier todo liste : %s

source: Can not open %s réprtoire. You have the right permissions on /home/user/.griffon/todo/
fr: Ne peux pas ouvrir le réprtoire %s. Avez vous les bons droits sur /home/user/.griffon/todo/

source: Can not write file %s. You do not have the proper rights propablement.
fr: Ne peux pas écrire le fichier %s. Vous n'avez propablement pas les bons droits.

source: Add a new line
fr: Ajouter une nouvelle ligne

source: Edit a line
fr: Editer une ligne

source: Do you really want delete this line?
fr: Voulez vous vraiment supprimer cette ligne?

source: Can not remove% s. You have the right permissions on %s?
fr: Ne peux pas supprimer %s. Avez vous les bons droits sur %s?

source: MINIDO_DB not findable variable (normally /home/user/.griffon/todo/).
fr: MINIDO_DB variable non trouvable (normalement /home/user/.griffon/todo/).

source: 1 Functions base [PHP]
fr: 1 Fonctions base [PHP]

source: 1.1 (php) to start a PHP script
fr: 1.1 (php) débuter un script PHP

source: 1.2 (php) echo: Displays a character string
fr: 1.2 (php) echo : Affiche une chane de caractères

source: 1.3 (php) add a comment
fr: 1.3 (php) ajouter un commentaire

source: 1.4 (php) FUNCTION: create a function
fr: 1.4 (php) FUNCTION : créer une fonction

source: 1.5 (php) MAIL: send an email
fr: 1.5 (php) MAIL : envoyer un email

source: 1.7 (php) RAND: Generate a random value
fr: 1.7 (php) RAND : Génère une valeur aléatoire

source: 1.8 (php) POST: Display the POST variables
fr: 1.8 (php) POST : Afficher les variables POST

source: 2.4 (php) FOREACH: read a table row by row
fr: 2.4 (php) FOREACH : lire un tableau ligne par ligne

source: 3 File
fr: 3 Fichier

source: 3.1 (php) FILE: place the contents of a file (or url) in a table
fr: 3.1 (php) FILE : place le contenu d'un fichier (url possible) dans un tableau

source: 4 String
fr: 4 Chaîne de carctères

source: 4.1 (php) SPLIT: split a string with delimiter
fr: 4.1 (php) SPLIT : découper une chaîne avec séparateur

source: 4.2 (php) REPLACEMENT: find a string in a variable and replace
fr: 4.2 (php) REMPLACEMENT : trouver une chaîne dans une variable et la remplacer

source: 4.3 (php) IF string : if search for a string in another string
fr: 4.3 (php) IF chaîne : instruction rechercher une chaîne dans une autre chaîne

source: 4.4 (php) stripslashes: Removes backslashes in a string
fr: 4.4 (php) STRIPSLASHES : Supprime les antislashs d'une chaîne

source: 4.5 (php) STRLEN: Returns the size of the string
fr: 4.5 (php) STRLEN : Retourne la taille de la chaîne

source: 4.6 (php) urlencode: Encodes a URL string
fr: 4.6 (php) URLENCODE : Encode une chaîne en URL

source: 4.7 (php) mb_substr_count: Counts the number of occurrences of a substring
fr: 4.7 (php) MB_SUBSTR_COUNT : Compte le nombre d'occurrences d'une sous-chaîne

source: 4.8 (php) strip_tags: Removes HTML and PHP tags from a string
fr: 4.8 (php) STRIP_TAGS : Supprime les balises HTML et PHP d'une chaîne

source: 5.1 (php) connection to a MySql database
fr: 5.1 (php) connexion à une base MySql

source: 5.2 (php) LOOP SELECT: mysql select with recuperation loop data
fr: 5.2 (php) SELECT BOUCLE : select mysql avec boucle de récuperation des données

source: 5.3 (php) QUERY: simple query MySQL (UPDATE, DELETE, INSERT)
fr: 5.3 (php) QUERY : simple requete Mysql (UPDATE,DELETE,INSERT)

source: 5.4 (php) QUERY: simple query MySQL (SELECT)
fr: 5.4 (php) QUERY : simple requete Mysql (SELECT)

source: 5.5 (php) LAST_INSERT_ID: recuperation after an INSERT id
fr: 5.5 (php) LAST_INSERT_ID : récuperation d'un id après un INSERT

source: 6.1 (php) connection to an FTP server
fr: 6.1 (php) connexion à un serveur FTP

source: 6.2 (php) ftp_nlist: list files in a directory
fr: 6.2 (php) FTP_NLIST : lister les fichier d'un répertoire

source: 6.3 (php) ftp_put: upload a file
fr: 6.3 (php) FTP_PUT : déposer un fichier

source: 6.4 (php) FTP_DELETE: Delete a file
fr: 6.4 (php) FTP_DELETE : supprimer un fichier

source: 1 Basis of page [HTML]
fr: 1 Base de page [HTML]

source: 1.1 (html): Basic Template
fr: 1.1 (html) : Template de base

source: 1.2 (html): Comment
fr: 1.2 (html) : Commenter

source: 1.3 (html): Table [Option CMD: "{NBR_TR} - {NBR_TD}"]
fr: 1.3 (html) : Tableau [Option CMD : "{NBR_TR}-{NBR_TD}"]

source: 1.4 (html): HREF link around the selection
fr: 1.4 (html) : Lien HREF autour de la sélection

source: 1.5 (html): Integration of a css stylesheet
fr: 1.5 (html) : Intergation d'une feuille de style css

source: 1.6 (html): Reload (refresh) of a page every 30 seconds
fr: 1.6 (html) : Rechargement (refresh) d'une page toutes les 30 secondes

source: 1.7 (html): Tag image around the selection
fr: 1.7 (html) : Balise image autour de la séléction

source: 1.8 (html): Add a div around the selection
fr: 1.8 (html) : Ajouter un div autour de la sélection

source: 1.9 (html): add a style to a tag
fr: 1.9 (html) : Ajouter un style à une balise

source: 1.10 (html): Add a favicon 16x16. Ico format
fr: 1.10 (html) : Ajouter un favicon 16x16 format .ico

source: 2 Size
fr: 2 Taille

source: 2.1 (html) : [width]
fr: 2.1 (html) : [width] Largeur

source: 2.2 (html) : [height]
fr: 2.2 (html) : [height] Hauteur

source: 2.3 (html): [cols] number of columns (textarea)
fr: 2.3 (html) : [cols] nombre de colonne (textarea)

source: 2.4 (html) [rows] number line (textarea)
fr: 2.4 (html) : [rows] nombre de ligne (textarea)

source: 3 Form
fr: 3 Formulaire

source: 3.1 (html): Basic Form
fr: 3.1 (html) : Formulaire de base

source: 3.2 (html) text input area
fr: 3.2 (html) : Zone de saisie texte

source: 3.3 (html): textarea input field
fr: 3.3 (html) : Zone de saisie textarea

source: 3.4 (html): Zone option selection (SELECT)
fr: 3.4 (html) : Zone de sélection d'option (SELECT)

source: 1 Base Style Sheet [CSS]
fr: 1 Base de feuille de style [CSS]

source: 1.1 (css) Comment
fr: 1.1 (css) : Commenter

source: 1.2 (css): Style for body tag
fr: 1.2 (css) : Style pour balise body

source: 1.3 (css): Style for link
fr: 1.3 (css) : Style pour lien

source: 1.4 (css): Style for link hover
fr: 1.4 (css) : Style pour lien hover

source: 1.5 (css): Style for div tag with ID
fr: 1.5 (css) : Style pour balise div avec ID

source: 2 Basis background
fr: 2 Base background

source: 2.1 (css) [background] background color
fr: 2.1 (css) : [background] Couleur de fond

source: 2.2 (css) [background-image] Background Image
fr: 2.2 (css) : [background-image] Image de fond

source: 2.3 (css) [background-repeat] Option not repeated background image
fr: 2.3 (css) : [background-repeat] Option image de fond non répétée

source: 3.1 (css) : [font-family]
fr: 3.1 (css) : [font-family] style de font

source: 3.2 (css) : [font-size]
fr: 3.2 (css) : [font-size] Taille de la font

source: 3.3 (css) : [color] font color
fr: 3.3 (css) : [color] Courleur de la font

source: 3.4 (css) [decoration] No Text Decoration
fr: 3.4 (css) : [decoration] Pas de décoration de texte

source: 3.5 (css) [decoration] Underline Text
fr: 3.5 (css) : [decoration] Soulignement du texte

source: 4 Base size
fr: 4 Base taille

source: 4.1 (css) : [width] width
fr: 4.1 (css) : [largeur] width largeur

source: 4.2 (css) : [height] height
fr: 4.2 (css) : [hauteur] height hauteur

source: 5.1 (css) [position] on the relative positioning position of the previous
fr: 5.1 (css) : [position] relative Positionnement relatif par rapport la position de l'élément précédent

source: 5.2 (css) [position] absolute absolute positioning relative to the corner upper left of the document
fr: 5.2 (css) : [position] absolute Positionnement absolu par rapport au coin supérieur gauche du document

source: 5.3 (css) [position] fixed fixed positioning relative to the corner top left of the browser window
fr: 5.3 (css) : [position] fixed Positionnement fixe par rapport au coin suprieur gauche de la fentre du navigateur

source: 5.4 (css): [left] left Position from the left edge
fr: 5.4 (css) : [gauche] left Position à partire du bord gauche

source: 5.5 (css) [right] right position at the right
fr: 5.5 (css) : [droite] right position à partire du bord droit

source: 5.6 (css) [top] top position at the top
fr: 5.6 (css) : [haut] top position à partire du bord haut

source: 5.7 (css): [low] bottom position to the bottom edge
fr: 5.7 (css) : [bas] bottom position à partire du bord bas

source: 5.8 (css) [valign] vertical alignment down bottom
fr: 5.8 (css) : [valign] alignement vertical en bas bottom

source: 5.9 (css) [valign] top vertical alignment
fr: 5.9 (css) : [valign] alignement vertical en haut

source: 6 Base Display
fr: 6 Base affichage

source: 6.1 (css): [none] The display element is hidden
fr: 6.1 (css) : [none] display L'élément est masqué

source: 6.2 (css) [block] display display one below the other
fr: 6.2 (css) : [block] display Affichage l'un en-dessous de l'autre

source: 6.3 (css) [inline] View online display div
fr: 6.3 (css) : [inline] display Affichage en ligne des div

source: 1 Base [MYSQL]
fr: 1 Requete base [MYSQL]

source: 1.1 (javascript) HTML tag for javascript / jquery
fr: 1.1 (javascript) : Balise HTML pour javascript/jquery

source: 1.2 (javascript) : Create a function
fr: 1.2 (javascript) : Créer une fonction

source: 1.3 (javascript) : Split a string into array by separating
fr: 1.3 (javascript) : Split d'une chaîne en tableau par séparateur

source: 2 Interaction with ID
fr: 2 Intéraction avec un ID

source: 2.1 (javascript) : Recovery of a value by id
fr: 2.1 (javascript) : Récuperation d'un value par id

source: 2.2 (javascript) : Recovery of value by id in a HTML select
fr: 2.2 (javascript) : Récuperation d'un value par id sur un select HTML

source: 2.3 (javascript) : Focus on an id
fr: 2.3 (javascript) : Focus sur un id

source: 2.4 (javascript) : Upload a file php / html in a div id
fr: 2.4 (javascript) : Charger un fichier php/html dans un div id

source: 2.5 (javascript) : Replace the content of a div id with another text
fr: 2.5 (javascript) : Remplacer le contenu d'un div id par un autre texte

source: 2.6 (javascript): Replace the contents of an html id value in another text
fr: 2.6 (javascript) : Remplacer le contenu d'un value html id par un autre texte

source: 2.7 (javascript): Add the contents of a text html id value
fr: 2.7 (javascript) : Ajouter un texte au contenu d'un value html id

source: 3 List of events
fr: 3 Liste des évenements

source: 3.1 (javascript): [onBlur] output action focus
fr: 3.1 (javascript) : [onBlur] action en sortie de focus

source: 3.2 (javascript): [onChange] action for change
fr: 3.2 (javascript) : [onChange] action pour un changement

source: 3.3 (javascript): [onClick] action for a click
fr: 3.3 (javascript) : [onClick] action pour un click

source: 3.4 (javascript): [onFocus] taking action focus
fr: 3.4 (javascript) : [onFocus] action sur prise de focus

source: 3.5 (javascript): [onLoad] action after loading
fr: 3.5 (javascript) : [onLoad] action en fin de chargement

source: 3.6 (javascript): [onMouseOver] action mouseover
fr: 3.6 (javascript) : [onMouseOver] action au passage de la souris

source: 3.7 (javascript): [onSelect] action for selection
fr: 3.7 (javascript) : [onSelect] action pour une séléction
